data = [
"Street: P.O. Box 367, 4311 Ut, Street City: Midlands Province: ON Postal Code: N0K 3C3",
"Street: 2062 Vivamus Ave City: Northumberland Province: ON Postal Code: K3Z 6Y4",
"Street: P.O. Box 981, 7568 In St. City: Pemberton Province: BC Postal Code: V0P 0M7",
"Street: Ap #863-7488 Nunc Rd. City: Pointe-aux-Trembles Province: QC Postal Code: G4H 6M8",
"Street: P.O. Box 697, 6667 Et Road City: Matagami Province: QC Postal Code: J2V 5J5",
"Street: P.O. Box 487, 6148 Nunc Av. City: Kingston Province: ON Postal Code: P3S 0C8",
"Street: 404-3539 In St. City: Winnipeg Province: MB Postal Code: R0Z 4T3",
"Street: 164-8513 Mollis Avenue City: Pitt Meadows Province: BC Postal Code: V0E 9L4",
"Street: 1506 Mi, St. City: Minto Province: ON Postal Code: K6C 8P6",
"Street: 1817 Consequat, Rd. City: Aurora Province: ON Postal Code: K6E 5X0",
"Street: 756-2184 Nulla St. City: Hudson's Hope Province: BC Postal Code: V3A 9Z6",
"Street: 4530 Cursus. Road City: Gander Province: NL Postal Code: A3Y 1V0",
"Street: 757-1480 Ultrices, Avenue City: Leamington Province: ON Postal Code: M5Y 5E2",
"Street: P.O. Box 508, 2044 Lectus Rd. City: Etobicoke Province: ON Postal Code: N3M 6E6",
"Street: 379-6797 Donec Av. City: Lourdes Province: MB Postal Code: R7V 9Y2",
"Street: 9702 Sollicitudin Street City: Whitby Province: ON Postal Code: P0E 4H0",
"Street: P.O. Box 231, 469 Dolor St. City: Orilla Province: ON Postal Code: L8Y 3N7",
"Street: 632-9172 Hendrerit. St. City: Greater Sudbury Province: ON Postal Code: K0E 5M2",
"Street: P.O. Box 396, 1954 Laoreet, Avenue City: Woodstock Province: ON Postal Code: M4T 6W7",
"Street: P.O. Box 254, 7854 Arcu Ave City: Williams Lake Province: BC Postal Code: V6B 0P9",
"Street: 8327 Hendrerit Ave City: Montague Province: PE Postal Code: C6Y 8L8",
"Street: 6699 Purus, Av. City: Kitchener Province: ON Postal Code: P8T 0P2",
"Street: P.O. Box 877, 8403 Varius. Street City: Pointe-au-Pic Province: QC Postal Code: H3N 3W3",
"Street: 140-2975 Dignissim Avenue City: Chelsea Province: QC Postal Code: J4E 0W9",
"Street: 403-7406 Suspendisse Road City: Canora Province: SK Postal Code: S5N 4M8",
"Street: P.O. Box 323, 995 Donec Rd. City: Lacombe Province: AB Postal Code: T6N 0M3",
"Street: Ap #812-9958 Sit St. City: Hope Province: BC Postal Code: V8H 1C0",
"Street: 590-8748 Nibh. St. City: Estevan Province: SK Postal Code: S0Y 5E5",
"Street: P.O. Box 705, 5742 Eu Street City: Coquitlam Province: BC Postal Code: V5W 6Y6",
"Street: 647 Malesuada Street City: Flin Flon Province: MB Postal Code: R8P 7T7",
"Street: 1971 Risus Rd. City: Lourdes Province: MB Postal Code: R7R 4K4",
"Street: 924-7252 Feugiat St. City: Greater Sudbury Province: ON Postal Code: L5Y 5T6",
"Street: Ap #682-5728 Id Street City: Beaconsfield Province: QC Postal Code: J1X 3C4",
"Street: 490-2286 Mauris, Avenue City: Leamington Province: ON Postal Code: M9Z 3Y6",
"Street: Ap #983-6219 Ad Road City: Maria Province: QC Postal Code: H4R 2X1",
"Street: 974-9649 Vestibulum Rd. City: Fraser-Fort George Province: BC Postal Code: V6X 8C1",
"Street: P.O. Box 420, 6542 Porttitor Avenue City: Kearny Province: ON Postal Code: K8J 7R9",
"Street: P.O. Box 966, 836 Vitae St. City: Daly Province: MB Postal Code: R9X 8J3",
"Street: 1557 Lacus. Avenue City: Scarborough Province: ON Postal Code: P5L 6P7",
"Street: P.O. Box 663, 6989 Nisl St. City: Vanderhoof Province: BC Postal Code: V0N 9V0",
"Street: P.O. Box 644, 6397 Aliquet Rd. City: Asbestos Province: QC Postal Code: G5P 4J8",
"Street: P.O. Box 158, 1791 Nec, Rd. City: Whitby Province: ON Postal Code: K3L 5E3",
"Street: 2340 Justo Rd. City: Kingston Province: ON Postal Code: M0J 2E6",
"Street: 6610 Sit Av. City: Colwood Province: BC Postal Code: V5V 2K3",
"Street: 248-9049 Mattis Rd. City: Smoky Lake Province: AB Postal Code: T8Z 8A2",
"Street: 8809 Pharetra. Av. City: Hearst Province: ON Postal Code: N4S 4K9",
"Street: P.O. Box 261, 9819 Dapibus Road City: Lions Bay Province: BC Postal Code: V8N 1X9",
"Street: 6462 Nullam Av. City: Vancouver Province: BC Postal Code: V2C 4H1",
"Street: 4579 Non, Rd. City: Notre-Dame-de-la-Salette Province: QC Postal Code: H5C 0K5",
"Street: 1228 Accumsan Rd. City: Orangeville Province: ON Postal Code: M9Y 1C3",
"Street: P.O. Box 531, 7468 Semper Road City: Tay Province: ON Postal Code: N6J 2P3",
"Street: Ap #351-580 Ac, Avenue City: Toronto Province: ON Postal Code: N6W 8W4",
"Street: 535-263 Maecenas St. City: Russell Province: ON Postal Code: L0H 7S5",
"Street: Ap #585-4731 Placerat St. City: St. Albert Province: AB Postal Code: T0W 3Z7",
"Street: P.O. Box 915, 5163 Sem Rd. City: Prince Albert Province: SK Postal Code: S5K 2J4",
"Street: 829 Quam St. City: Lanark County Province: ON Postal Code: M1K 5S7",
"Street: 614-5445 Vulputate Av. City: Argyle Province: NS Postal Code: B9V 6K2",
"Street: 238-8231 Metus. Road City: Paulatuk Province: NT Postal Code: X4Y 7C2",
"Street: 4317 At Avenue City: Gloucester Province: ON Postal Code: N4B 0W6",
"Street: 2167 Ut Ave City: Nakusp Province: BC Postal Code: V7X 5K5",
"Street: 6754 Curabitur Street City: Pitt Meadows Province: BC Postal Code: V7K 3H9",
"Street: 216-5333 Donec Road City: Weyburn Province: SK Postal Code: S0Z 8Y7",
"Street: Ap #451-1783 Eget Avenue City: Blind River Province: ON Postal Code: L5V 2B8",
"Street: Ap #996-2888 Quis Av. City: Lakeshore Province: ON Postal Code: N7R 6P9",
"Street: Ap #982-3235 Est Rd. City: Renfrew Province: ON Postal Code: K4Z 8Y0",
"Street: Ap #677-5777 Faucibus Rd. City: Caplan Province: QC Postal Code: J5X 4E8",
"Street: P.O. Box 400, 3558 Aliquet St. City: Richmond Hill Province: ON Postal Code: L1N 9M5",
"Street: P.O. Box 951, 7819 Semper St. City: Northumberland Province: ON Postal Code: K1N 0A8",
"Street: Ap #934-341 Odio. Avenue City: Pickering Province: ON Postal Code: P9S 6N4",
"Street: Ap #371-5924 Enim. Av. City: McCallum Province: NL Postal Code: A8J 3A6",
"Street: P.O. Box 980, 1575 Hymenaeos. Road City: Saguenay Province: QC Postal Code: G4C 0S7",
"Street: 7451 Sagittis. Street City: Fort Resolution Province: NT Postal Code: X8Y 4L1",
"Street: Ap #839-9240 Metus. Av. City: Kearny Province: ON Postal Code: M3V 4L1",
"Street: 923-6379 Est Road City: Thurso Province: QC Postal Code: H4L 5X9",
"Street: 204-289 Sodales Av. City: Rimbey Province: AB Postal Code: T9N 2C5",
"Street: 8105 Mattis Avenue City: Ottawa Province: ON Postal Code: K3R 3T8",
"Street: P.O. Box 145, 4673 Vitae Avenue City: Welland Province: ON Postal Code: L7A 8H9",
"Street: Ap #497-7067 Eu Street City: Thurso Province: QC Postal Code: H3V 2A6",
"Street: Ap #258-2196 Nam Avenue City: Maple Ridge Province: BC Postal Code: V5L 1Y4",
"Street: 757-7089 Euismod Avenue City: Municipal District Province: NS Postal Code: B2V 8E2",
"Street: P.O. Box 737, 8444 Curabitur Ave City: St. Thomas Province: ON Postal Code: P8E 4E9",
"Street: 973 Odio Road City: Grey County Province: ON Postal Code: P0G 2A3",
"Street: 9536 Mauris Ave City: LaSalle Province: ON Postal Code: M7R 9H4",
"Street: 9492 Id Av. City: Kawartha Lakes Province: ON Postal Code: P0R 7G4",
"Street: Ap #844-8465 Aenean Rd. City: Tsiigehtchic Province: NT Postal Code: X3G 1W2",
"Street: 790-8781 Sagittis St. City: Alert Bay Province: BC Postal Code: V4R 9A8",
"Street: P.O. Box 825, 7752 Donec Rd. City: Roxboro Province: QC Postal Code: G3Z 1Y6",
"Street: 340-3461 Mollis Avenue City: Kent Province: BC Postal Code: V4N 5W4",
"Street: P.O. Box 978, 6185 Ac, Rd. City: Houston Province: BC Postal Code: V2L 5P9",
"Street: 259-2713 Purus, Rd. City: Kawartha Lakes Province: ON Postal Code: N2G 4A4",
"Street: 2450 Massa Rd. City: Welland Province: ON Postal Code: N1B 6G8",
"Street: Ap #681-3575 Egestas St. City: Rivière-du-Loup Province: QC Postal Code: J4W 2E2",
"Street: 351-3758 Vel, Road City: Kearny Province: ON Postal Code: K6L 6K9",
"Street: P.O. Box 857, 2433 Proin Road City: Sherbrooke Province: QC Postal Code: J4S 2R4",
"Street: Ap #434-8522 Erat, St. City: Cranbrook Province: BC Postal Code: V3H 9J8",
"Street: P.O. Box 301, 1272 Neque Road City: Pierrefonds Province: QC Postal Code: J7A 2Y3",
"Street: P.O. Box 458, 8381 Dui. Rd. City: Drayton Valley Province: AB Postal Code: T7E 7Z0",
"Street: Ap #832-2564 Tristique Ave City: Lac La Biche County Province: AB Postal Code: T9B 3Z5",
"Street: Ap #140-3559 Elit, St. City: Newbury Province: ON Postal Code: N6V 9J0",
"Street: P.O. Box 830, 3761 Sociis Ave City: Aurora Province: ON Postal Code: K7W 3B5"]
