data = [
"Street: P.O. Box 367, 4311 Ut, Street City: Midlands State: ON Zip: N0K 3C3",
"Street: 2062 Vivamus Ave City: Northumberland State: ON Zip: K3Z 6Y4",
"Street: P.O. Box 981, 7568 In St. City: Pemberton State: BC Zip: V0P 0M7",
"Street: Ap #863-7488 Nunc Rd. City: Pointe-aux-Trembles State: QC Zip: G4H 6M8",
"Street: P.O. Box 697, 6667 Et Road City: Matagami State: QC Zip: J2V 5J5",
"Street: P.O. Box 487, 6148 Nunc Av. City: Kingston State: ON Zip: P3S 0C8",
"Street: 404-3539 In St. City: Winnipeg State: MB Zip: R0Z 4T3",
"Street: 164-8513 Mollis Avenue City: Pitt Meadows State: BC Zip: V0E 9L4",
"Street: 1506 Mi, St. City: Minto State: ON Zip: K6C 8P6",
"Street: 1817 Consequat, Rd. City: Aurora State: ON Zip: K6E 5X0",
"Street: 756-2184 Nulla St. City: Hudson's Hope State: BC Zip: V3A 9Z6",
"Street: 4530 Cursus. Road City: Gander State: NL Zip: A3Y 1V0",
"Street: 757-1480 Ultrices, Avenue City: Leamington State: ON Zip: M5Y 5E2",
"Street: P.O. Box 508, 2044 Lectus Rd. City: Etobicoke State: ON Zip: N3M 6E6",
"Street: 379-6797 Donec Av. City: Lourdes State: MB Zip: R7V 9Y2",
"Street: 9702 Sollicitudin Street City: Whitby State: ON Zip: P0E 4H0",
"Street: P.O. Box 231, 469 Dolor St. City: Orilla State: ON Zip: L8Y 3N7",
"Street: 632-9172 Hendrerit. St. City: Greater Sudbury State: ON Zip: K0E 5M2",
"Street: P.O. Box 396, 1954 Laoreet, Avenue City: Woodstock State: ON Zip: M4T 6W7",
"Street: P.O. Box 254, 7854 Arcu Ave City: Williams Lake State: BC Zip: V6B 0P9",
"Street: 8327 Hendrerit Ave City: Montague State: PE Zip: C6Y 8L8",
"Street: 6699 Purus, Av. City: Kitchener State: ON Zip: P8T 0P2",
"Street: P.O. Box 877, 8403 Varius. Street City: Pointe-au-Pic State: QC Zip: H3N 3W3",
"Street: 140-2975 Dignissim Avenue City: Chelsea State: QC Zip: J4E 0W9",
"Street: 403-7406 Suspendisse Road City: Canora State: SK Zip: S5N 4M8",
"Street: P.O. Box 323, 995 Donec Rd. City: Lacombe State: AB Zip: T6N 0M3",
"Street: Ap #812-9958 Sit St. City: Hope State: BC Zip: V8H 1C0",
"Street: 590-8748 Nibh. St. City: Estevan State: SK Zip: S0Y 5E5",
"Street: P.O. Box 705, 5742 Eu Street City: Coquitlam State: BC Zip: V5W 6Y6",
"Street: 647 Malesuada Street City: Flin Flon State: MB Zip: R8P 7T7",
"Street: 1971 Risus Rd. City: Lourdes State: MB Zip: R7R 4K4",
"Street: 924-7252 Feugiat St. City: Greater Sudbury State: ON Zip: L5Y 5T6",
"Street: Ap #682-5728 Id Street City: Beaconsfield State: QC Zip: J1X 3C4",
"Street: 490-2286 Mauris, Avenue City: Leamington State: ON Zip: M9Z 3Y6",
"Street: Ap #983-6219 Ad Road City: Maria State: QC Zip: H4R 2X1",
"Street: 974-9649 Vestibulum Rd. City: Fraser-Fort George State: BC Zip: V6X 8C1",
"Street: P.O. Box 420, 6542 Porttitor Avenue City: Kearny State: ON Zip: K8J 7R9",
"Street: P.O. Box 966, 836 Vitae St. City: Daly State: MB Zip: R9X 8J3",
"Street: 1557 Lacus. Avenue City: Scarborough State: ON Zip: P5L 6P7",
"Street: P.O. Box 663, 6989 Nisl St. City: Vanderhoof State: BC Zip: V0N 9V0",
"Street: P.O. Box 644, 6397 Aliquet Rd. City: Asbestos State: QC Zip: G5P 4J8",
"Street: P.O. Box 158, 1791 Nec, Rd. City: Whitby State: ON Zip: K3L 5E3",
"Street: 2340 Justo Rd. City: Kingston State: ON Zip: M0J 2E6",
"Street: 6610 Sit Av. City: Colwood State: BC Zip: V5V 2K3",
"Street: 248-9049 Mattis Rd. City: Smoky Lake State: AB Zip: T8Z 8A2",
"Street: 8809 Pharetra. Av. City: Hearst State: ON Zip: N4S 4K9",
"Street: P.O. Box 261, 9819 Dapibus Road City: Lions Bay State: BC Zip: V8N 1X9",
"Street: 6462 Nullam Av. City: Vancouver State: BC Zip: V2C 4H1",
"Street: 4579 Non, Rd. City: Notre-Dame-de-la-Salette State: QC Zip: H5C 0K5",
"Street: 1228 Accumsan Rd. City: Orangeville State: ON Zip: M9Y 1C3",
"Street: P.O. Box 531, 7468 Semper Road City: Tay State: ON Zip: N6J 2P3",
"Street: Ap #351-580 Ac, Avenue City: Toronto State: ON Zip: N6W 8W4",
"Street: 535-263 Maecenas St. City: Russell State: ON Zip: L0H 7S5",
"Street: Ap #585-4731 Placerat St. City: St. Albert State: AB Zip: T0W 3Z7",
"Street: P.O. Box 915, 5163 Sem Rd. City: Prince Albert State: SK Zip: S5K 2J4",
"Street: 829 Quam St. City: Lanark County State: ON Zip: M1K 5S7",
"Street: 614-5445 Vulputate Av. City: Argyle State: NS Zip: B9V 6K2",
"Street: 238-8231 Metus. Road City: Paulatuk State: NT Zip: X4Y 7C2",
"Street: 4317 At Avenue City: Gloucester State: ON Zip: N4B 0W6",
"Street: 2167 Ut Ave City: Nakusp State: BC Zip: V7X 5K5",
"Street: 6754 Curabitur Street City: Pitt Meadows State: BC Zip: V7K 3H9",
"Street: 216-5333 Donec Road City: Weyburn State: SK Zip: S0Z 8Y7",
"Street: Ap #451-1783 Eget Avenue City: Blind River State: ON Zip: L5V 2B8",
"Street: Ap #996-2888 Quis Av. City: Lakeshore State: ON Zip: N7R 6P9",
"Street: Ap #982-3235 Est Rd. City: Renfrew State: ON Zip: K4Z 8Y0",
"Street: Ap #677-5777 Faucibus Rd. City: Caplan State: QC Zip: J5X 4E8",
"Street: P.O. Box 400, 3558 Aliquet St. City: Richmond Hill State: ON Zip: L1N 9M5",
"Street: P.O. Box 951, 7819 Semper St. City: Northumberland State: ON Zip: K1N 0A8",
"Street: Ap #934-341 Odio. Avenue City: Pickering State: ON Zip: P9S 6N4",
"Street: Ap #371-5924 Enim. Av. City: McCallum State: NL Zip: A8J 3A6",
"Street: P.O. Box 980, 1575 Hymenaeos. Road City: Saguenay State: QC Zip: G4C 0S7",
"Street: 7451 Sagittis. Street City: Fort Resolution State: NT Zip: X8Y 4L1",
"Street: Ap #839-9240 Metus. Av. City: Kearny State: ON Zip: M3V 4L1",
"Street: 923-6379 Est Road City: Thurso State: QC Zip: H4L 5X9",
"Street: 204-289 Sodales Av. City: Rimbey State: AB Zip: T9N 2C5",
"Street: 8105 Mattis Avenue City: Ottawa State: ON Zip: K3R 3T8",
"Street: P.O. Box 145, 4673 Vitae Avenue City: Welland State: ON Zip: L7A 8H9",
"Street: Ap #497-7067 Eu Street City: Thurso State: QC Zip: H3V 2A6",
"Street: Ap #258-2196 Nam Avenue City: Maple Ridge State: BC Zip: V5L 1Y4",
"Street: 757-7089 Euismod Avenue City: Municipal District State: NS Zip: B2V 8E2",
"Street: P.O. Box 737, 8444 Curabitur Ave City: St. Thomas State: ON Zip: P8E 4E9",
"Street: 973 Odio Road City: Grey County State: ON Zip: P0G 2A3",
"Street: 9536 Mauris Ave City: LaSalle State: ON Zip: M7R 9H4",
"Street: 9492 Id Av. City: Kawartha Lakes State: ON Zip: P0R 7G4",
"Street: Ap #844-8465 Aenean Rd. City: Tsiigehtchic State: NT Zip: X3G 1W2",
"Street: 790-8781 Sagittis St. City: Alert Bay State: BC Zip: V4R 9A8",
"Street: P.O. Box 825, 7752 Donec Rd. City: Roxboro State: QC Zip: G3Z 1Y6",
"Street: 340-3461 Mollis Avenue City: Kent State: BC Zip: V4N 5W4",
"Street: P.O. Box 978, 6185 Ac, Rd. City: Houston State: BC Zip: V2L 5P9",
"Street: 259-2713 Purus, Rd. City: Kawartha Lakes State: ON Zip: N2G 4A4",
"Street: 2450 Massa Rd. City: Welland State: ON Zip: N1B 6G8",
"Street: Ap #681-3575 Egestas St. City: Rivière-du-Loup State: QC Zip: J4W 2E2",
"Street: 351-3758 Vel, Road City: Kearny State: ON Zip: K6L 6K9",
"Street: P.O. Box 857, 2433 Proin Road City: Sherbrooke State: QC Zip: J4S 2R4",
"Street: Ap #434-8522 Erat, St. City: Cranbrook State: BC Zip: V3H 9J8",
"Street: P.O. Box 301, 1272 Neque Road City: Pierrefonds State: QC Zip: J7A 2Y3",
"Street: P.O. Box 458, 8381 Dui. Rd. City: Drayton Valley State: AB Zip: T7E 7Z0",
"Street: Ap #832-2564 Tristique Ave City: Lac La Biche County State: AB Zip: T9B 3Z5",
"Street: Ap #140-3559 Elit, St. City: Newbury State: ON Zip: N6V 9J0",
"Street: P.O. Box 830, 3761 Sociis Ave City: Aurora State: ON Zip: K7W 3B5"]
